# Week 1 Pandas - Joshua Lewi (2473018)

In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

## Prefix & Suffix

In [5]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)

df

   A  B  C  D  E
0  8  7  6  5  8
1  3  3  5  8  5
2  3  5  4  8  6
3  9  6  3  1  3
4  9  9  6  2  1

In [7]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [9]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        8        7        6        5        8
1        3        3        5        8        5
2        3        5        4        8        6
3        9        6        3        1        3
4        9        9        6        2        1

In [11]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        8        7        6        5        8
1        3        3        5        8        5
2        3        5        4        8        6
3        9        6        3        1        3
4        9        9        6        2        1

## Pemilihan Baris

In [26]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  4  3  4  1  2
1  1  2  3  4  3
2  4  2  4  2  4
3  4  3  3  2  2
4  2  3  4  4  2
5  4  3  1  1  3
6  3  1  3  2  4
7  1  3  2  1  3
8  2  4  2  3  2
9  4  1  3  1  1

Fungsi Operator Logika |

In [28]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  1  2  3  4  3
6  3  1  3  2  4
7  1  3  2  1  3

Fungsi isin()

In [30]:
df[(df['A'].isin([1,3]))]

   A  B  C  D  E
1  1  2  3  4  3
6  3  1  3  2  4
7  1  3  2  1  3

Operator Negasi "~"

In [32]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  4  3  4  1  2
2  4  2  4  2  4
3  4  3  3  2  2
4  2  3  4  4  2
5  4  3  1  1  3
8  2  4  2  3  2
9  4  1  3  1  1

## Konversi String ke Numerik

In [42]:
data = {'col1':['1', '2', '3', 'teks'],
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [44]:
df.dtypes

col1    object
col2    object
dtype: object

Konversi tipe data dengan fungsi astype()

In [58]:
df_x = df.astype({'col2':'float'})
df_x

   col1  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

In [60]:
df_x.dtypes

col1     object
col2    float64
dtype: object

In [64]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## Pemilihan Kolom Berdasarkan Tipe Data

In [73]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2025-01-01', periods=n_rows, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

C:\Users\JoshuaL\AppData\Local\Temp\ipykernel_19652\1969087345.py:9: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  df.index = pd.date_range(start='2025-01-01', periods=n_rows, freq='H')

                index  bil_pecahan  bil_bulat teks
0 2025-01-01 00:00:00         11.0          5    A
1 2025-01-01 01:00:00         12.0          9    B
2 2025-01-01 02:00:00          1.0         13    C
3 2025-01-01 03:00:00         16.0         14    D
4 2025-01-01 04:00:00         18.0          9    E

In [75]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

Tipe data Numerik

In [78]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         11.0          5
1         12.0          9
2          1.0         13
3         16.0         14
4         18.0          9

In [80]:
df.select_dtypes(include='float')

   bil_pecahan
0         11.0
1         12.0
2          1.0
3         16.0
4         18.0

In [82]:
df.select_dtypes(include='int')

   bil_bulat
0          5
1          9
2         13
3         14
4          9

String/Object (tipe datanya)

In [84]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

datetime tipe data

In [88]:
df.select_dtypes(include='datetime')

                index
0 2025-01-01 00:00:00
1 2025-01-01 01:00:00
2 2025-01-01 02:00:00
3 2025-01-01 03:00:00
4 2025-01-01 04:00:00

kombinasi tipe data

In [91]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         11.0          5    A
1         12.0          9    B
2          1.0         13    C
3         16.0         14    D
4         18.0          9    E